Revit 2024 API
RebarShapeDefinition Properties
The RebarShapeDefinition type exposes the following members.
Properties
Name | Description
Complete
 Report whether the shape definition is fully constrained.
IsPlanar
 Reports whether the shape definition lies within a plane: false if a spiral, true in all other cases.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace